package cydspx.globalInfo;

public class Const {
	public static final String[] degree_types = new String[] {
			"学士",
			"硕士",
			"博士"
	};
	
	public static final String[] services = new String[] {
			"开课",
			"讲座",
			"担任评委",
			"知道帮扶",
			"其他"
	};
	
	public static final String[] subject_categories = new String[] {
			"学术型学士",
			"学术型硕士",
			"学术型博士",
			"专业型学士",
			"专业型硕士",
			"专业型博士"
	};
	

	public static final String[] titles = new String[] {
			"高级专业技术职务",
			"中级专业技术职务",
			"初级专业技术职务"
	};
	
	public static final String[] vocations = new String[] {
			"农、林、牧、渔业",
			"采矿业",
			"制造业",
			"电力、燃气及水的生产和供应业",
			"建筑业",
			"交通运输、仓储和邮政业",
			"信息传输、计算机服务和软件业",
			"批发和零售业",
			"住宿和餐饮业",
			"金融业",
			"房地产业",
			"租赁和商务服务业",
			"科学研究、技术服务和地质勘查业",
			"水利、环境和公共设施管理业",
			"居民服务和其他服务业",
			"教育",
			"卫生、社会保障和社会福利业",
			"文化、体育和娱乐业",
			"公共管理与社会组织",
			"国际组织"
	};
	
	public static final String[] nations = new String[] {
			"汉族",
			"蒙古族",
			"回族",
			"藏族",
			"维吾尔族",
			"苗族",
			"彝族",
			"壮族",
			"布依族",
			"朝鲜族",
			"满族",
			"侗族",
			"瑶族",
			"白族",
			"土家族",
			"哈尼族",
			"哈萨克族",
			"傣族",
			"黎族",
			"傈僳族",
			"佤族",
			"畲族",
			"高山族",
			"拉祜族",
			"水族",
			"东乡族",
			"纳西族",
			"景颇族",
			"柯尔克孜族",
			"土族",
			"达斡尔族",
			"仫佬族",
			"羌族",
			"布朗族",
			"撒拉族",
			"毛南族",
			"仡佬族",
			"锡伯族",
			"阿昌族",
			"普米族",
			"塔吉克族",
			"怒族",
			"乌孜别克族",
			"俄罗斯族",
			"鄂温克族",
			"德昂族",
			"保安族",
			"裕固族",
			"京族",
			"塔塔尔族",
			"独龙族",
			"鄂伦春族",
			"赫哲族",
			"门巴族",
			"珞巴族",
			"基诺族",
			"其他"
	};
	
}
